_protected/frontend/controllers/NursejobController.php

    public function actionIndex()
    {

         $query = new Query();
        $data = $query->select(['department.dep_name','count'=>'Count(*)'])
                ->from('personnel')
                ->leftJoin('department', ' personnel.dep_id = department.dep_id')
                ->where(['personnel.position_id'=>'01'])
                ->groupBy('personnel.dep_id')

                ->all();
---
SELECT `department`.`dep_name`, Count(*) AS `count` FROM `personnel` LEFT JOIN `department` ON  personnel.dep_id = department.dep_id WHERE `personnel`.`position_id`='01' GROUP BY `personnel`.`dep_id`