_protected/frontend/controllers/PersonnelController.php

    protected function findModel($id)
    {
        if (($model = Personnel::findOne($id)) !== null) {
---
SELECT * FROM `personnel` WHERE `person_id`='000001'